/*:
## แบบฝึกหัด - ใช้ Playground

 โค้ดด้านล่างจะแสดงผลสองสามข้อความสั้นๆ เกี่ยวกับสิ่งที่คุณได้เรียนรู้ในบทเรียนนี้ เปิดพื้นที่ของจอคอนโซลและดูเอาท์พุตของโค้ด
 */
print("ฉันได้เรียนรู้สิ่งต่อไปนี้")
print("คุณสมบัติที่ทำให้ Swift เป็นภาษายุคใหม่ที่ปลอดภัย")
print("วิธีใช้ Swift REPL ใน Terminal")
print("วิธีใช้ Playground เพื่อทำให้การเขียน Swift เป็นเรื่องสนุกและง่ายดาย")
//:  ทีนี้ให้แสดงผลข้อความของคุณเองไปยังจอคอนโซล เลือกเพลงที่คุณชอบมาหนึ่งเพลง ใช้ความรู้จากฟังก์ชั่น `print` เพื่อแสดงชื่อเพลงและศิลปิน
print("Song: Come Along\nArtist: Kimza Music")


//:  ใช้ฟังก์ชั่น `print` หลายๆ รายการเพื่อเขียนเนื้อเพลงบางส่วนของเพลงนั้น 
print("\nLyrics:\nI walked in the palace from a guy who is now seeking love\nLive is in the edge trying to find the life that is above")



/*:
 _ลิขสิทธิ์ © 2021 Apple Inc._

 _การอนุญาต ณ ที่นี้ ไม่มีค่าใช้จ่ายใดๆ สำหรับบุคคลที่ได้รับสำเนาของซอฟต์แวร์นี้ รวมถึงไฟล์เอกสารที่เกี่ยวข้อง (เรียกว่า "ซอฟต์แวร์") เพื่อการใช้งานซอฟต์แวร์โดยไม่มีข้อจำกัด รวมถึงแต่ไม่จำกัดเฉพาะ สิทธิ์ในการใช้งาน คัดลอก แก้ไข รวมเข้าด้วยกัน เผยแพร่ แจกจ่าย ให้ช่วงสิทธิ์ และ/หรือขายสำเนาของซอฟต์แวร์ และอนุญาตให้บุคคลที่ได้รับซอฟต์แวร์ไปเพื่อกระทำการดังกล่าว ต้องปฏิบัติตามเงื่อนไขต่อไปนี้_

 _ประกาศลิขสิทธิ์ข้างต้นและประกาศอนุญาตนี้จะรวมอยู่ในสำเนาทั้งหมดหรือส่วนสำคัญของซอฟต์แวร์_

 _ซอฟต์แวร์นี้จัดหาให้ "อย่างที่เป็น" โดยไม่มีการรับประกันใดๆ ไม่ว่าโดยชัดแจ้งหรือโดยนัย รวมถึงแต่ไม่จำกัดเพียงการรับประกันเรื่องความสามารถทางการค้า ความเหมาะสมในการใช้งานสำหรับวัตถุประสงค์อย่างใดเป็นการเฉพาะ และการไม่ละเมิด เจ้าของลิขสิทธิ์หรือผู้ถือครองสิทธิ์จะไม่รับผิดในทุกกรณีต่อข้อเรียกร้อง ความเสียหาย หรือความรับผิดใดๆ ไม่ว่าจะเป็นการกระทำของสัญญา การละเมิด หรือการกระทำอื่นใด ที่เกิดขึ้นจากหรือเกี่ยวข้องกับซอฟต์แวร์หรือการใช้งาน รวมถึงข้อตกลงอื่นๆ ในซอฟต์แวร์นี้_
 */
