/*:
## แบบฝึกหัด - ลำดับของตัวดำเนินการ

 แสดงผลค่าที่คุณคิดว่า 10 + 2 * 5 จะประเมินออกมาได้ จากนั้นแสดงผลนิพจน์จริง (ซึ่งก็คือ `print(10 + 2 * 5)`)
 */


//:  ในชุดคำสั่ง `print` ที่แยกต่างหาก ให้เพิ่มวงเล็บที่จำเป็นลงไป เพื่อให้การบวกเกิดขึ้นก่อนการคูณ


//:  แสดงผลค่าที่คุณคิดว่า 4 * 9 - 6 / 2 จะประเมินออกมาได้ จากนั้นแสดงผลนิพจน์จริง


//:  ในชุดคำสั่ง `print` ที่แยกต่างหาก ให้เพิ่มวงเล็บที่จำเป็นลงไป เพื่อให้ดำเนินการกับการลบก่อนการคูณและหาร


/*:
[ก่อนหน้า](@previous)  |  หน้า 5 จาก 8  |  [ถัดไป: แบบฝึกหัดแอป - การคำนวณข้อมูลฟิตเนสที่ซับซ้อน](@next)
 */