/*:
## แบบฝึกหัด - การกำหนดค่าแบบผสม

 ประกาศตัวแปรที่มีค่าเริ่มต้นที่ 10 อัปเดตค่าเป็น 15 โดยใช้ตัวดำเนินการกำหนดค่าแบบผสม โดยใช้การบวก อัปเดตค่าเป็น 30 โดยใช้ตัวดำเนินการกำหนดค่าแบบผสม โดยใช้การคูณ แสดงผลค่าของตัวแปรหลังการกำหนดแต่ละครั้ง 
 */


/*:
 สร้างตัวแปรที่ชื่อ `piggyBank` ที่เริ่มต้นที่ 0 คุณจะใช้ตัวแปรนี้เพื่อคอยติดตามเงินที่คุณได้รับและใช้จ่าย สำหรับแต่ละจุดด้านล่าง ให้ใช้ตัวดำเนินการกำหนดค่าแบบผสมเพื่ออัปเดตยอดเงินในกระปุกออมสิน
 
- เพื่อนบ้านให้เงินคุณ 10 ดอลลาร์ที่ช่วยตัดหญ้าในสนามให้เธอ
- คุณได้เงินเพิ่มอีก 20 ดอลลาร์ตลอดทั้งสัปดาห์จากการทำงานจิปาถะ
- คุณใช้จ่ายเงินครึ่งหนึ่งไปกับอาหารเย็นและภาพยนตร์
- คุณทำเงินได้เป็นสามเท่าของเงินที่เหลืออยู่ในกระปุกออมสินโดยการทำความสะอาดหน้าต่าง
- คุณใช้เงิน 3 ดอลลาร์ที่ร้านสะดวกซื้อ

 แสดงผลยอดเงินในกระปุกออมสินหลังจากแต่ละขั้นตอน
 */


/*:
[ก่อนหน้า](@previous)  |  หน้า 3 จาก 8  |  [ถัดไป: แบบฝึกหัดแอป - การนับ](@next)
 */