/*:
## แบบฝึกหัดแอป - การนับ

 >แบบฝึกหัดเหล่านี้เป็นการเน้นย้ำแนวคิดการใช้งาน Swift ในบริบทของแอปการติดตามข้อมูลฟิตเนส
 
 คุณสมบัติพื้นฐานที่สุดของแอปการติดตามข้อมูลฟิตเนสของคุณคือการนับจำนวนก้าว ให้สร้างตัวแปร `steps` แล้วตั้งค่าให้เท่ากับ 0 จากนั้นเพิ่มค่าของตัวแปรนี้ขึ้น 1 หน่วย เพื่อจำลองการก้าวเท้าของผู้ใช้
 */


/*:
 นอกจากการติดตามจำนวนก้าวแล้ว แอปการติดตามข้อมูลฟิตเนสของคุณยังติดตามระยะทางที่เดินทางอีกด้วย ให้สร้างตัวแปร `distance` ของประเภท `Double` และตั้งค่าให้เท่ากับ 50 ซึ่งจะแสดงว่าผู้ใช้เดินทางไปแล้ว 50 ฟุต
 
 แต่คุณตัดสินใจว่าจะแสดงระยะทางเป็นเมตรแทน 1 เมตรเท่ากับ 3 ฟุตโดยประมาณ ใช้ตัวดำเนินการกำหนดค่าแบบผสมเพื่อแปลง `distance` เป็นเมตร แสดงผลลัพธ์
 */


/*:
[ก่อนหน้า](@previous)  |  หน้า 4 จาก 8  |  [ถัดไป: แบบฝึกหัด - ลำดับของตัวดำเนินการ](@next)
 */