/*:
## แบบฝึกหัด - การแปลงประเภทตัวเลข

 สร้างค่าคงที่ของจำนวนเต็ม `x` ที่มีค่าเท่ากับ 10 และค่าคงที่ double `y` ที่มีค่าเท่ากับ 3.2 แล้วสร้างค่าคงที่ `multipliedAsIntegers` ที่เท่ากับ `x` คูณ `y` โค้ดนี้คอมไพล์หรือไม่ หากไม่คอมไพล์ ให้แก้ไขโดยแปลง `Double` เป็น `Int` ในนิพจน์ทางคณิตศาสตร์ แสดงผลลัพธ์
 */


//:  สร้างค่าคงที่ `multipliedAsDoubles` ที่เท่ากับ `x` คูณ `y` แต่คราวนี้ให้แปลง `Int` เป็น `Double` ในนิพจน์ แสดงผลลัพธ์


//:  ค่าของ `multipliedAsIntegers` และ `multipliedAsDoubles` แตกต่างกันหรือไม่ แสดงผลข้อความไปยังจอคอนโซลเพื่ออธิบายว่าเพราะอะไร


/*:
[ก่อนหน้า](@previous)  |  หน้า 7 จาก 8  |  [ถัดไป: แบบฝึกหัดแอป - การแปลงประเภท](@next)
 */