/*:
## แบบฝึกหัดแอป - การคำนวณข้อมูลฟิตเนสที่ซับซ้อน

 >แบบฝึกหัดเหล่านี้เป็นการเน้นย้ำแนวคิดการใช้งาน Swift ในบริบทของแอปการติดตามข้อมูลฟิตเนส
 
 หากคุณทำแบบฝึกหัดเกี่ยวกับการคำนวณข้อมูลฟิตเนสเสร็จสิ้นแล้ว แสดงว่าคุณได้คำนวณอัตราการเต้นของหัวใจโดยเฉลี่ยเพื่อแสดงต่อผู้ใช้ไปแล้ว แต่ถ้าใช้ลำดับของตัวดำเนินการที่เหมาะสม คุณจะสามารถทำสิ่งนี้ได้โดยใช้ขั้นตอนน้อยกว่า ให้สร้างค่าคงที่ของอัตราการเต้นของหัวใจที่แยกกัน 3 ค่า โดยทั้งหมดเป็นประเภท `Double` และมีค่าระหว่าง 60 ถึง 100 จากนั้นสร้างค่าคงที่ที่เท่ากับอัตราการเต้นของหัวใจโดยเฉลี่ย หากคุณใช้ลำดับของตัวดำเนินการที่ถูกต้อง คุณจะสามารถคำนวณอัตราการเต้นของหัวใจได้ในบรรทัดเดียว 
 */


/*:
 คุณสมบัติหนึ่งที่คุณอาจต้องการมอบให้ผู้ใช้คือการแสดงอุณหภูมิของร่างกายในปัจจุบัน สร้างค่าคงที่ `tempInFahrenheit` ที่เท่ากับ 98.6 

 คุณยังอาจต้องการแสดงอุณหภูมิเป็นเซลเซียสด้วย คุณสามารถแปลงฟาเรนไฮต์เป็นเซลเซียสได้โดยนำ `tempInFahrenheit` มาลบด้วย 32 แล้วคูณผลลัพธ์ด้วย (5.0/9.0) สร้างค่าคงที่ `tempInCelsius` ที่คำนวณอุณหภูมิเป็นเซลเซียสในบรรทัดเดียว
 */


/*:
[ก่อนหน้า](@previous)  |  หน้า 6 จาก 8  |  [ถัดไป: แบบฝึกหัด - การแปลงประเภทตัวเลข](@next)
 */