/*:
## แบบฝึกหัด - คณิตศาสตร์พื้นฐาน

 คุณตัดสินใจจะสร้างห้องเก็บของ และอยากจะรู้ก่อนว่าห้องเก็บของนั้นจะพื้นที่ลานบ้านเท่าไหร่ ให้สร้างค่าคงที่สองรายการ ได้แก่ `width` และ `height` ที่มีค่า 10 และ 20 ตามลำดับ สร้างค่าคงที่ `area` ที่เป็นผลคูณของค่าคงที่สองรายการก่อนหน้านี้ แล้วแสดงผลลัพธ์
 */


//:  คุณตัดสินใจว่าจะแบ่งห้องเก็บของออกเป็นสองห้อง คุณอยากรู้ว่าหากแบ่งห้องเก็บของให้เท่าๆ กันแล้วจะมีพื้นที่เหลือพอสำหรับตู้เก็บของขนาดใหญ่หรือไม่ สร้างค่าคงที่ `roomArea` ที่เป็นผลลัพธ์ของการหารครึ่งของ `area` แสดงผลลัพธ์


//:  สร้างค่าคงที่ `perimeter` ที่มีค่าเท่ากับ `width` บวก `width` บวก `height` บวก `height` จากนั้นให้แสดงผลลัพธ์


//:  แสดงผลลัพธ์การหารจำนวนเต็มของ 10 หารด้วย 3 ที่คุณคาดหวัง สร้างค่าคงที่ `integerDivisionResult` ที่เป็นผลลัพธ์ของ 10 หารด้วย 3 และแสดงค่า


//:  ทีนี้ให้สร้างค่าคงที่สองรายการ ได้แก่ `double10` และ `double3` ตั้งค่าเป็น 10 และ 3 จากนั้นประกาศประเภทเป็นค่า `Double` ประกาศค่าคงที่สุดท้าย `divisionResult` ที่เท่ากับผลลัพธ์ของ `double10` หารด้วย `double3` จากนั้นแสดงค่าของ `divisionResult` ค่านี้แตกต่างจากค่าที่ได้เมื่อใช้การหารจำนวนเต็มอย่างไร


/*:
 กำหนดให้ค่าพายคือ (3.1415927) แล้วสร้างค่าคงที่ `radius` ที่มีค่าเท่ากับ 5.0 จากนั้นคำนวณเส้นผ่านศูนย์กลางและเส้นรอบวงของวงกลมโดยใช้สมการต่อไปนี้ แล้วแสดงผลลัพธ์

 *diameter = 2 * radius*

 *circumference = 2 * pi * radius.*
 */
let pi = 3.1415927 


//:  สร้างค่าคงที่ของจำนวนเต็ม โดยใช้ตัวดำเนินการมอดูลัส ให้ตั้งค่าเป็นเศษของ 12 หารด้วย 5


//:  สร้างค่าคงที่ของจำนวนเต็มสองรายการ ได้แก่ `even` และ `odd` แล้วตั้งค่าเป็นจำนวนเต็มคู่และจำนวนเต็มคี่ใดๆ ก็ได้ตามลำดับ สำหรับแต่ละรายการ ให้แสดงผลเศษจากการหารค่าด้วย 2 เมื่อพิจารณาผลลัพธ์แล้ว คุณคิดว่าคุณสามารถใช้ตัวดำเนินการหารเอาเศษเพื่อระบุว่าจำนวนเต็มเป็นเลขคู่หรือเลขคี่ได้หรือไม่


/*:
หน้า 1 จาก 8  |  [ถัดไป: แบบฝึกหัดแอป - การคำนวณข้อมูลฟิตเนส](@next)
 */