/*:
## แบบฝึกหัดแอป - การคำนวณข้อมูลฟิตเนส

 >แบบฝึกหัดเหล่านี้เป็นการเน้นย้ำแนวคิดการใช้งาน Swift ในบริบทของแอปการติดตามข้อมูลฟิตเนส
 
 ตัวติดตามข้อมูลฟิตเนสของคุณจะคอยติดตามอัตราการเต้นของหัวใจของผู้ใช้ แต่คุณยังอาจต้องการแสดงอัตราการเต้นของหัวใจโดยเฉลี่ยในช่วงชั่วโมงที่ผ่านมาด้วย สร้างค่าคงที่ `heartRate1`, `heartRate2` และ `heartRate3` กำหนดค่าที่แตกต่างกัน ตั้งแต่ 60 ถึง 100 ให้แต่ละค่าคงที่ สร้างค่าคงที่ `addedHR` ที่เท่ากับผลรวมของอัตราการเต้นของหัวใจทั้ง 3 รายการ ทีนี้ให้สร้างค่าคงที่ที่ชื่อ `averageHR` ที่เท่ากับ `addedHR` หารด้วย 3 เพื่อหาค่าเฉลี่ย แสดงผลลัพธ์
 */


//:  ทีนี้ให้สร้างค่าคงที่เพิ่มอีกสามรายการ ได้แก่ `heartRate1D`, `heartRate2D` และ `heartRate3D` ที่มีค่าเท่ากันกับ `heartRate1`, `heartRate2` และ `heartRate3` ค่าคงที่ใหม่เหล่านี้ควรเป็นประเภท `Double` สร้างค่าคงที่ `addedHRD` ที่เท่ากับผลรวมของอัตราการเต้นของหัวใจทั้ง 3 รายการ สร้างค่าคงที่ที่ชื่อ `averageHRD` ที่เท่ากับ `addedHRD` หารด้วย 3 เพื่อหาค่าเฉลี่ยของค่าคงที่สำหรับอัตราการเต้นของหัวใจใหม่ แสดงผลลัพธ์ ค่าเฉลี่ยนี้แตกต่างจากค่าเฉลี่ยก่อนหน้านี้หรือไม่ เพราะเหตุใดถึงเหมือนกันหรือไม่เหมือนกัน


//:  สมมติว่าในระหว่างวันผู้ใช้เดินไปแล้ว 3,467 ก้าว จากเป้าหมาย 10,000 ก้าว ให้สร้างค่าคงที่ `steps` และ `goal` ทั้งสองค่าตั้งเป็นประเภท `Double` เพื่อที่คุณจะสามารถทำการคำนวณได้อย่างแม่นยำ ควรกำหนดค่า 3,467 ให้กับ `steps` และกำหนดค่า 10,000 ให้กับ `goal` สร้างค่าคงที่ `percentOfGoal` ที่เท่ากับนิพจน์ที่ประเมินเปอร์เซ็นต์ของเป้าหมายที่ทำสำเร็จแล้วจนถึงตอนนี้


/*:
[ก่อนหน้า](@previous)  |  หน้า 2 จาก 8  |  [ถัดไป: แบบฝึกหัด - การกำหนดค่าแบบผสม](@next)
 */